yunwuhai/BUGU_Temp/workspace/embedded/test/Make_STM32_Test_1/Core/0_0_Trans_BUGU_HAL/sub/0_0_0_SubTrans_0_STM32F401CC/inc/0_0_0_SubTrans_0_STM32F401CC_1_CLK.h
#ifndef __0_0_0_SUBTRANS_0_STM32F401CC_1_CLK_H__
#define __0_0_0_SUBTRANS_0_STM32F401CC_1_CLK_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_utils.h"

/***************************************************************
说明：这是数据枚举从C语言中引入已经存在的数据枚举的特殊情况。
实现方法：
前端：
可以在弹窗选择从SDK引入数据枚举开关，此时枚举项英语名是必填的，它代表了SDK中通过宏定义或变量实现的枚举，然后生成结果为：
#define .._SDK_EnumOptionName SDK_EnumOptionName
本质上就是给SDK的数据枚举添加了一个前缀使代码风格统一

但注意，虽然在实现上我们可以通过这个方法引入任何数据，但是在概念上我们只应该用这种方法引入外部类似枚举的宏定义
***************************************************************/

/***************************************************************
从此处开始，后续注释将省略不需要解释的内容
前端填入数据
初始化方式：本体初始化
对象类型：SDK引入数据枚举
枚举类型：无符号32位整数
填写进制：（不需要这个了）
枚举项表：
0.（只举一例，后面递推）
枚举项英语名：LL_APB1_GRP1_PERIPH_PWR
枚举项简介：
枚举项值：（不需要这个了）
***************************************************************/
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_0_LL_APB1_GRP1_PERIPH_0_LL_APB1_GRP1_PERIPH_PWR LL_APB1_GRP1_PERIPH_PWR

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_1_LL_APB2_GRP1_PERIPH_0_LL_APB2_GRP1_PERIPH_SYSCFG LL_APB2_GRP1_PERIPH_SYSCFG

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_RCC_PLLSOURCE_0_LL_RCC_PLLSOURCE_HSI LL_RCC_PLLSOURCE_HSI
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_RCC_PLLSOURCE_1_LL_RCC_PLLSOURCE_HSE LL_RCC_PLLSOURCE_HSE

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_0_LL_RCC_PLLM_DIV_2    LL_RCC_PLLM_DIV_2 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_1_LL_RCC_PLLM_DIV_3    LL_RCC_PLLM_DIV_3 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_2_LL_RCC_PLLM_DIV_4    LL_RCC_PLLM_DIV_4 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_3_LL_RCC_PLLM_DIV_5    LL_RCC_PLLM_DIV_5 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_4_LL_RCC_PLLM_DIV_6    LL_RCC_PLLM_DIV_6 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_5_LL_RCC_PLLM_DIV_7    LL_RCC_PLLM_DIV_7 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_6_LL_RCC_PLLM_DIV_8    LL_RCC_PLLM_DIV_8 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_7_LL_RCC_PLLM_DIV_9    LL_RCC_PLLM_DIV_9 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_8_LL_RCC_PLLM_DIV_10   LL_RCC_PLLM_DIV_10
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_9_LL_RCC_PLLM_DIV_11   LL_RCC_PLLM_DIV_11
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_10_LL_RCC_PLLM_DIV_12  LL_RCC_PLLM_DIV_12
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_11_LL_RCC_PLLM_DIV_13  LL_RCC_PLLM_DIV_13
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_12_LL_RCC_PLLM_DIV_14  LL_RCC_PLLM_DIV_14
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_13_LL_RCC_PLLM_DIV_15  LL_RCC_PLLM_DIV_15
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_14_LL_RCC_PLLM_DIV_16  LL_RCC_PLLM_DIV_16
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_15_LL_RCC_PLLM_DIV_17  LL_RCC_PLLM_DIV_17
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_16_LL_RCC_PLLM_DIV_18  LL_RCC_PLLM_DIV_18
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_17_LL_RCC_PLLM_DIV_19  LL_RCC_PLLM_DIV_19
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_18_LL_RCC_PLLM_DIV_20  LL_RCC_PLLM_DIV_20
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_19_LL_RCC_PLLM_DIV_21  LL_RCC_PLLM_DIV_21
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_RCC_PLLM_DIV_20_LL_RCC_PLLM_DIV_22  LL_RCC_PLLM_DIV_22

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_4_LL_RCC_PLLP_DIV_0_LL_RCC_PLLP_DIV_2    LL_RCC_PLLP_DIV_2
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_4_LL_RCC_PLLP_DIV_1_LL_RCC_PLLP_DIV_4    LL_RCC_PLLP_DIV_4
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_4_LL_RCC_PLLP_DIV_2_LL_RCC_PLLP_DIV_6    LL_RCC_PLLP_DIV_6
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_4_LL_RCC_PLLP_DIV_3_LL_RCC_PLLP_DIV_8    LL_RCC_PLLP_DIV_8

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_0_LL_RCC_SYSCLK_DIV_1    LL_RCC_SYSCLK_DIV_1  
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_1_LL_RCC_SYSCLK_DIV_2    LL_RCC_SYSCLK_DIV_2  
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_2_LL_RCC_SYSCLK_DIV_4    LL_RCC_SYSCLK_DIV_4  
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_3_LL_RCC_SYSCLK_DIV_8    LL_RCC_SYSCLK_DIV_8  
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_4_LL_RCC_SYSCLK_DIV_16   LL_RCC_SYSCLK_DIV_16 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_5_LL_RCC_SYSCLK_DIV_64   LL_RCC_SYSCLK_DIV_64 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_6_LL_RCC_SYSCLK_DIV_128  LL_RCC_SYSCLK_DIV_128
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_7_LL_RCC_SYSCLK_DIV_256  LL_RCC_SYSCLK_DIV_256
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_SYSCLK_DIV_8_LL_RCC_SYSCLK_DIV_512  LL_RCC_SYSCLK_DIV_512

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_APB1_DIV_0_LL_RCC_APB1_DIV_1    LL_RCC_APB1_DIV_1 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_APB1_DIV_1_LL_RCC_APB1_DIV_2    LL_RCC_APB1_DIV_2 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_APB1_DIV_2_LL_RCC_APB1_DIV_4    LL_RCC_APB1_DIV_4 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_APB1_DIV_3_LL_RCC_APB1_DIV_8    LL_RCC_APB1_DIV_8 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_APB1_DIV_4_LL_RCC_APB1_DIV_16   LL_RCC_APB1_DIV_16

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_APB2_DIV_0_LL_RCC_APB2_DIV_1    LL_RCC_APB2_DIV_1 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_APB2_DIV_1_LL_RCC_APB2_DIV_2    LL_RCC_APB2_DIV_2 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_APB2_DIV_2_LL_RCC_APB2_DIV_4    LL_RCC_APB2_DIV_4 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_APB2_DIV_3_LL_RCC_APB2_DIV_8    LL_RCC_APB2_DIV_8 
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_APB2_DIV_4_LL_RCC_APB2_DIV_16   LL_RCC_APB2_DIV_16

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_8_LL_RCC_SYS_CLKSOURCE_0_LL_RCC_SYS_CLKSOURCE_HSI    LL_RCC_SYS_CLKSOURCE_HSI
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_8_LL_RCC_SYS_CLKSOURCE_1_LL_RCC_SYS_CLKSOURCE_HSE    LL_RCC_SYS_CLKSOURCE_HSE
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_8_LL_RCC_SYS_CLKSOURCE_2_LL_RCC_SYS_CLKSOURCE_PLL    LL_RCC_SYS_CLKSOURCE_PLL

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_9_LL_RCC_SYS_CLKSOURCE_STATUS_0_LL_RCC_SYS_CLKSOURCE_STATUS_HSI  LL_RCC_SYS_CLKSOURCE_STATUS_HSI
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_9_LL_RCC_SYS_CLKSOURCE_STATUS_1_LL_RCC_SYS_CLKSOURCE_STATUS_HSE  LL_RCC_SYS_CLKSOURCE_STATUS_HSE
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_9_LL_RCC_SYS_CLKSOURCE_STATUS_2_LL_RCC_SYS_CLKSOURCE_STATUS_PLL  LL_RCC_SYS_CLKSOURCE_STATUS_PLL

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_10_LL_RCC_TIM_PRESCALER_0_LL_RCC_TIM_PRESCALER_TWICE LL_RCC_TIM_PRESCALER_TWICE

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_0_LL_AHB1_GRP1_PERIPH_GPIOA       LL_AHB1_GRP1_PERIPH_GPIOA
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_1_LL_AHB1_GRP1_PERIPH_GPIOB       LL_AHB1_GRP1_PERIPH_GPIOB
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_2_LL_AHB1_GRP1_PERIPH_GPIOC       LL_AHB1_GRP1_PERIPH_GPIOC
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_3_LL_AHB1_GRP1_PERIPH_GPIOD       LL_AHB1_GRP1_PERIPH_GPIOD
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_4_LL_AHB1_GRP1_PERIPH_GPIOE       LL_AHB1_GRP1_PERIPH_GPIOE
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_5_LL_AHB1_GRP1_PERIPH_GPIOF       LL_AHB1_GRP1_PERIPH_GPIOF
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_6_LL_AHB1_GRP1_PERIPH_GPIOG       LL_AHB1_GRP1_PERIPH_GPIOG
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_7_LL_AHB1_GRP1_PERIPH_GPIOH       LL_AHB1_GRP1_PERIPH_GPIOH
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_8_LL_AHB1_GRP1_PERIPH_GPIOI       LL_AHB1_GRP1_PERIPH_GPIOI
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_9_LL_AHB1_GRP1_PERIPH_GPIOJ       LL_AHB1_GRP1_PERIPH_GPIOJ
#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_AHB1_GRP1_PERIPH_10_LL_AHB1_GRP1_PERIPH_GPIOK      LL_AHB1_GRP1_PERIPH_GPIOK

#define Object_DataEnum_0_0_0_SubTrans_0_STM32F401CC_1_CLK_12_LL_APB2_GRP1_PERIPH_0_LL_APB2_GRP1_PERIPH_USART1  LL_APB2_GRP1_PERIPH_USART1

#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_0_LL_APB1_GRP1_EnableClock_0_Extern(IFormParam_DataEnum_0_Periphs) LL_APB1_GRP1_EnableClock(IFormParam_DataEnum_0_Periphs)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_1_LL_APB2_GRP1_EnableClock_0_Extern(IFormParam_DataEnum_0_Periphs) LL_APB2_GRP1_EnableClock(IFormParam_DataEnum_0_Periphs)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_2_LL_AHB1_GRP1_EnableClock_0_Extern(IFormParam_DataEnum_0_Periphs) LL_AHB1_GRP1_EnableClock(IFormParam_DataEnum_0_Periphs)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_3_LL_AHB2_GRP1_EnableClock_0_Extern(IFormParam_DataEnum_0_Periphs) LL_AHB2_GRP1_EnableClock(IFormParam_DataEnum_0_Periphs)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_4_LL_RCC_PLL_ConfigDomain_SYS_0_Extern(IFormParam_DataEnum_0_Source, IFormParam_DataEnum_1_PLLM, IFormParam_U32_2_PLLN, IFormParam_DataEnum_3_PLLP_R) LL_RCC_PLL_ConfigDomain_SYS(IFormParam_DataEnum_0_Source, IFormParam_DataEnum_1_PLLM, IFormParam_U32_2_PLLN, IFormParam_DataEnum_3_PLLP_R)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_5_LL_RCC_PLL_Enable_0_Extern() LL_RCC_PLL_Enable()
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_6_LL_RCC_PLL_IsReady_0_Extern(OFormParam_U32_0_State) *OFormParam_U32_0_State = LL_RCC_PLL_IsReady()
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_7_LL_RCC_SetAHBPrescaler_0_Extern(IFormParam_DataEnum_0_Prescaler) LL_RCC_SetAHBPrescaler(IFormParam_DataEnum_0_Prescaler)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_8_LL_RCC_SetAPB1Prescaler_0_Extern(IFormParam_DataEnum_0_Prescaler) LL_RCC_SetAPB1Prescaler(IFormParam_DataEnum_0_Prescaler)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_9_LL_RCC_SetAPB2Prescaler_0_Extern(IFormParam_DataEnum_0_Prescaler) LL_RCC_SetAPB2Prescaler(IFormParam_DataEnum_0_Prescaler)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_10_LL_RCC_SetSysClkSource_0_Extern(IFormParam_DataEnum_0_Source) LL_RCC_SetSysClkSource(IFormParam_DataEnum_0_Source)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_11_LL_RCC_GetSysClkSource_0_Extern(OFormParam_DataEnum_0_Source) *OFormParam_DataEnum_0_Source = LL_RCC_GetSysClkSource()
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_12_LL_RCC_HSE_IsReady_0_Extern(OFormParam_U32_0_State) *OFormParam_U32_0_State = LL_RCC_HSE_IsReady()
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_13_LL_RCC_HSE_Enable_0_Extern() LL_RCC_HSE_Enable()
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_14_LL_RCC_SetTIMPrescaler_0_Extern(IFormParam_DataEnum_0_Prescaler) LL_RCC_SetTIMPrescaler(IFormParam_DataEnum_0_Prescaler)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_15_LL_SetSystemCoreClock_0_Extern(IFormParam_U32_0_HCLKFrequency) LL_SetSystemCoreClock(IFormParam_U32_0_HCLKFrequency)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_16_LL_Init1msTick_0_Extern(IFormParam_U32_0_HCLKFrequency) LL_Init1msTick(IFormParam_U32_0_HCLKFrequency)
#define Func_0_0_0_SubTrans_0_STM32F401CC_1_CLK_17_LL_mDelay_0_Extern(IFormParam_U32_0_Delay) LL_mDelay(IFormParam_U32_0_Delay)

#ifdef __cplusplus
}
#endif

#endif